---
kind: property
id: P:Autodesk.Revit.DB.GenericForm.IsSolid
source: html/8d62241f-2efe-6581-4a70-83a0be66413c.htm
---
# Autodesk.Revit.DB.GenericForm.IsSolid Property

Identifies if the GenericForm is a solid or a void element.

## Syntax (C#)
```csharp
public bool IsSolid { get; }
```